Executing: Test 3 (without NICK)
===================================================================
Response: :irc.example.net 451 * :Connection not registered
Response: ERROR :Closing connection
2025-03-18 13:29:22 timeout (no response for 5 sec)
===================================================================
Executing: Test 1 (normal)
===================================================================
Response: :irc.example.net 433 * testuser :Nickname already in use
Response: :irc.example.net 451 * :Connection not registered
Response: ERROR :Closing connection
2025-03-18 13:29:23 timeout (no response for 5 sec)
===================================================================
Executing: Test 7 (double USER)
===================================================================
Response: :irc.example.net 001 testuser :Welcome to the Internet Relay Network testuser!~testuser@localhost
Response: :irc.example.net 002 testuser :Your host is irc.example.net, running version ngircd-26.1 (aarch64/unknown/linux-gnu)
Response: :irc.example.net 003 testuser :This server has been started Tue Feb 25 2025 at 13:09:06 (UTC)
Response: :irc.example.net 004 testuser irc.example.net ngircd-26.1 abBcCFiIoqrRswx abehiIklmMnoOPqQrRstvVz
Response: :irc.example.net 005 testuser RFC2812 IRCD=ngIRCd CHARSET=UTF-8 CASEMAPPING=ascii PREFIX=(qaohv)~&@%+ CHANTYPES=#&+ CHANMODES=beI,k,l,imMnOPQRstVz CHANLIMIT=#&+:10 :are supported on this server
Response: :irc.example.net 005 testuser CHANNELLEN=50 NICKLEN=9 TOPICLEN=490 AWAYLEN=127 KICKLEN=400 MODES=5 MAXLIST=beI:50 EXCEPTS=e INVEX=I PENALTY FNC :are supported on this server
Response: :irc.example.net 251 testuser :There are 1 users and 0 services on 1 servers
Response: :irc.example.net 253 testuser 9 :unknown connection(s)
Response: :irc.example.net 254 testuser 1 :channels formed
Response: :irc.example.net 255 testuser :I have 1 users, 0 services and 0 servers
Response: :irc.example.net 265 testuser 1 2 :Current local users: 1, Max: 2
Response: :irc.example.net 266 testuser 1 2 :Current global users: 1, Max: 2
Response: :irc.example.net 250 testuser :Highest connection count: 10 (579 connections received)
Response: :irc.example.net 375 testuser :- irc.example.net message of the day
Response: :irc.example.net 372 testuser :- **************************************************
Response: :irc.example.net 372 testuser :- *             H    E    L    L    O              *
Response: :irc.example.net 372 testuser :- *  This is a private irc server. Please contact  *
Response: :irc.example.net 372 testuser :- *  the admin of the server for any questions or  *
Response: :irc.example.net 372 testuser :- *  issues.                                       *
Response: :irc.example.net 372 testuser :- **************************************************
Response: :irc.example.net 372 testuser :- *  The software was provided as a package of     *
Response: :irc.example.net 372 testuser :- *  Debian GNU/Linux <https://www.debian.org/>.   *
Response: :irc.example.net 372 testuser :- *  However, Debian has no control over this      *
Response: :irc.example.net 372 testuser :- *  server.                                       *
Response: :irc.example.net 372 testuser :- **************************************************
Response: :irc.example.net 376 testuser :End of MOTD command
Response: :irc.example.net 462 testuser :Connection already registered
Response: :testuser!~testuser@localhost JOIN :#testchannel
2025-03-18 13:29:23 timeout (no response for 5 sec)
===================================================================
Executing: Test 2 (without PASS)
===================================================================
Response: :irc.example.net 433 * testuser :Nickname already in use
Response: :irc.example.net 451 * :Connection not registered
Response: ERROR :Closing connection
2025-03-18 13:29:23 timeout (no response for 5 sec)
===================================================================
Executing: Test 4 (without USER)
===================================================================
Response: :irc.example.net 433 * testuser :Nickname already in use
Response: :irc.example.net 451 * :Connection not registered
Response: :irc.example.net 451 * :Connection not registered
Response: ERROR :Closing connection
2025-03-18 13:29:25 timeout (no response for 5 sec)
===================================================================
Executing: Test 9 (valid command before login)
===================================================================
Response: :irc.example.net 433 * testuser :Nickname already in use
Response: :irc.example.net 451 * :Connection not registered
Response: :irc.example.net 451 * :Connection not registered
Response: :irc.example.net 451 * :Connection not registered
Response: ERROR :Closing connection
2025-03-18 13:29:27 timeout (no response for 5 sec)
===================================================================
Executing: Test 8 (valid command before login)
===================================================================
Response: :irc.example.net 451 * :Connection not registered
Response: :irc.example.net 433 * testuser :Nickname already in use
Response: :irc.example.net 451 * :Connection not registered
Response: :irc.example.net 451 * :Connection not registered
Response: ERROR :Closing connection
2025-03-18 13:29:27 timeout (no response for 5 sec)
===================================================================
Executing: Test 6 (double NICK)
===================================================================
Response: :irc.example.net 433 * testuser :Nickname already in use
Response: :irc.example.net 433 * testuser :Nickname already in use
Response: :irc.example.net 451 * :Connection not registered
Response: :irc.example.net 451 * :Connection not registered
Response: ERROR :Closing connection
2025-03-18 13:29:27 timeout (no response for 5 sec)
===================================================================
Executing: Test 5 (double PASS)
===================================================================
Response: :irc.example.net 462 * :Connection already registered
Response: :irc.example.net 433 * testuser :Nickname already in use
Response: :irc.example.net 451 * :Connection not registered
Response: :irc.example.net 451 * :Connection not registered
Response: ERROR :Closing connection
2025-03-18 13:29:27 timeout (no response for 5 sec)
===================================================================
Executing: Test 10 (valid command before login)
===================================================================
Response: :irc.example.net 451 * :Connection not registered
Response: :irc.example.net 433 * testuser :Nickname already in use
Response: :irc.example.net 451 * :Connection not registered
Response: :irc.example.net 451 * :Connection not registered
Response: ERROR :Closing connection
2025-03-18 13:29:28 timeout (no response for 5 sec)
===================================================================
